var kinds = [
    {
      "code": "00",
      "name": "食品",
      "child": [
        {
          "code": "0000",
          "name": "酒类",
          "child": [
            {
              "code": "000000",
              "name": "白酒"
            },
            {
              "code": "000001",
              "name": "啤酒"
            },
            {
              "code": "000002",
              "name": "葡萄酒"
            },
            {
              "code": "000003",
              "name": "黄酒"
            },
            {
              "code": "000004",
              "name": "配制酒"
            },
            {
              "code": "000005",
              "name": "其他蒸馏酒"
            },
            {
              "code": "000006",
              "name": "果酒（发酵型）及其他发酵酒 "
            }
          ]
        },
        {
          "code": "0001",
          "name": "饮料",
          "child": [
            {
              "code": "000100",
              "name": "包装饮用水"
            },
            {
              "code": "000101",
              "name": "茶饮料"
            },
            {
              "code": "000102",
              "name": "碳酸饮料"
            },
            {
              "code": "000103",
              "name": "蛋白饮料"
            },
            {
              "code": "000104",
              "name": "冷冻饮品"
            },
            {
              "code": "000105",
              "name": "咖啡饮料"
            },
            {
              "code": "000106",
              "name": "固体饮料"
            },
            {
              "code": "000107",
              "name": "果蔬汁饮料"
            },
            {
              "code": "000108",
              "name": "其它茶饮"
            }
          ]
        },
        {
          "code": "0002",
          "name": "米面粮油",
          "child": [
            {
              "code": "000200",
              "name": "食用油"
            },
            {
              "code": "000201",
              "name": "米类及其制品"
            },
            {
              "code": "000202",
              "name": "麦类及其制品"
            },
            {
              "code": "000203",
              "name": "薯类及其制品"
            },
            {
              "code": "000204",
              "name": "其他米面粮油"
            }
          ]
        },
        {
          "code": "0003",
          "name": "调味品",
          "child": [
            {
              "code": "000300",
              "name": "食盐"
            },
            {
              "code": "000301",
              "name": "食糖"
            },
            {
              "code": "000302",
              "name": "酱油 "
            },
            {
              "code": "000303",
              "name": "食醋  "
            },
            {
              "code": "000304",
              "name": "味精"
            },
            {
              "code": "000305",
              "name": "酱类 "
            },
            {
              "code": "000306",
              "name": "调味料酒   "
            },
            {
              "code": "000307",
              "name": "香辛料类   "
            },
            {
              "code": "000308",
              "name": "固体复合调味料 "
            },
            {
              "code": "000309",
              "name": "半固体复合调味料 "
            },
            {
              "code": "000310",
              "name": "液体复合调味料 "
            },
            {
              "code": "000311",
              "name": "其他调味品"
            }
          ]
        },
        {
          "code": "0004",
          "name": "方便速食",
          "child": [
            {
              "code": "000400",
              "name": "饼干 "
            },
            {
              "code": "000401",
              "name": "糕点 "
            },
            {
              "code": "000402",
              "name": "罐头"
            },
            {
              "code": "000403",
              "name": "糖果制品 "
            },
            {
              "code": "000404",
              "name": "薯类及膨化食品"
            },
            {
              "code": "000405",
              "name": "炒货及坚果制品  "
            },
            {
              "code": "000406",
              "name": "可可及焙烤咖啡产品 "
            },
            {
              "code": "000407",
              "name": "其他方便速食"
            }
          ]
        },
        {
          "code": "0005",
          "name": "食用农产品",
          "child": [
            {
              "code": "000500",
              "name": "茶叶及其制品"
            },
            {
              "code": "000501",
              "name": "蔬菜及其制品"
            },
            {
              "code": "000502",
              "name": "水果及其制品"
            },
            {
              "code": "000503",
              "name": "水产及其制品"
            },
            {
              "code": "000504",
              "name": "肉类及其制品"
            },
            {
              "code": "000505",
              "name": "蛋类及其制品"
            },
            {
              "code": "000506",
              "name": "笋类及其制品"
            },
            {
              "code": "000507",
              "name": "菌类及其制品"
            },
            {
              "code": "000508",
              "name": "豆类及其制品"
            },
            {
              "code": "000509",
              "name": "蜂类及其制品"
            },
            {
              "code": "000510",
              "name": "乳类及其制品"
            },
            {
              "code": "000511",
              "name": "淀粉及其制品"
            },
            {
              "code": "000512",
              "name": "其它食用农产品"
            }
          ]
        },
        {
          "code": "0006",
          "name": "速冻食品",
          "child": [
            {
              "code": "000600",
              "name": "速冻面米食品"
            },
            {
              "code": "000601",
              "name": "速冻谷物食品 "
            },
            {
              "code": "000602",
              "name": "速冻调理肉制品  "
            },
            {
              "code": "000603",
              "name": "速冻水产制品 "
            },
            {
              "code": "000604",
              "name": "速冻蔬菜制品 "
            },
            {
              "code": "000605",
              "name": "速冻水果制品  "
            }
          ]
        },
        {
          "code": "0007",
          "name": "特殊食品",
          "child": [
            {
              "code": "000700",
              "name": "特殊医学用途配方食品  "
            },
            {
              "code": "000701",
              "name": "婴幼儿配方食品  "
            },
            {
              "code": "000702",
              "name": "婴幼儿谷类辅助食品 "
            },
            {
              "code": "000703",
              "name": "婴幼儿罐装辅助食品 "
            },
            {
              "code": "000704",
              "name": "营养补充品  "
            }
          ]
        },
        {
          "code": "0008",
          "name": "食品相关",
          "child": [
            {
              "code": "000800",
              "name": "水质检验"
            },
            {
              "code": "000801",
              "name": "微生物检验"
            },
            {
              "code": "000802",
              "name": "食品添加剂"
            },
            {
              "code": "000803",
              "name": "寄生虫检验"
            },
            {
              "code": "000804",
              "name": "食品用洗涤剂"
            },
            {
              "code": "000805",
              "name": "食品相关通则/标准"
            },
            {
              "code": "000806",
              "name": "食品理化检验"
            },
            {
              "code": "000807",
              "name": "食品毒理试验"
            },
            {
              "code": "000808",
              "name": "产地环境条件"
            },
            {
              "code": "000809",
              "name": "食品相关机械"
            },
            {
              "code": "000810",
              "name": "食品卫生/安全指标"
            },
            {
              "code": "000811",
              "name": "动/植物农/兽药残留"
            },
            {
              "code": "000812",
              "name": "食品包装/容器/接触材料"
            },
            {
              "code": "000813",
              "name": "其它食品相关"
            }
          ]
        },
        {
          "code": "0009",
          "name": "其他食品",
          "child": [
            {
              "code": "000900",
              "name": "绿色食品"
            },
            {
              "code": "000901",
              "name": "保健食品"
            },
            {
              "code": "000902",
              "name": "无公害食品"
            },
            {
              "code": "000903",
              "name": "转基因产品"
            },
            {
              "code": "000904",
              "name": "地理标志产品"
            },
            {
              "code": "000905",
              "name": "其他食品"
            }
          ]
        }
      ]
    },
    {
      "code": "01",
      "name": "建材家居",
      "child": [
        {
          "code": "0100",
          "name": "基础建材",
          "child": [
            {
              "code": "010000",
              "name": "沙"
            },
            {
              "code": "010001",
              "name": "水泥"
            },
            {
              "code": "010002",
              "name": "玻璃"
            },
            {
              "code": "010003",
              "name": "瓷砖"
            },
            {
              "code": "010004",
              "name": "石料"
            },
            {
              "code": "010005",
              "name": "陶瓷"
            },
            {
              "code": "010006",
              "name": "油漆"
            },
            {
              "code": "010007",
              "name": "涂料"
            },
            {
              "code": "010008",
              "name": "木料"
            },
            {
              "code": "010009",
              "name": "胶水"
            },
            {
              "code": "010010",
              "name": "混凝土"
            },
            {
              "code": "010011",
              "name": "管材管件"
            },
            {
              "code": "010012",
              "name": "其他"
            }
          ]
        },
        {
          "code": "0101",
          "name": "厨房卫浴",
          "child": [
            {
              "code": "010100",
              "name": "厨房用品"
            },
            {
              "code": "010101",
              "name": "卫浴用品"
            }
          ]
        },
        {
          "code": "0102",
          "name": "电工电料",
          "child": [
            {
              "code": "010200",
              "name": "开关"
            },
            {
              "code": "010201",
              "name": "电机"
            },
            {
              "code": "010202",
              "name": "接触器"
            },
            {
              "code": "010203",
              "name": "继电器"
            },
            {
              "code": "010204",
              "name": "电磁阀"
            },
            {
              "code": "010205",
              "name": "接线排"
            },
            {
              "code": "010206",
              "name": "开关箱"
            },
            {
              "code": "010207",
              "name": "电线电缆"
            },
            {
              "code": "010208",
              "name": "其他电工电料"
            }
          ]
        },
        {
          "code": "0103",
          "name": "五金工具",
          "child": [
            {
              "code": "010300",
              "name": "照明工具"
            },
            {
              "code": "010301",
              "name": "手动工具"
            },
            {
              "code": "010302",
              "name": "电动工具"
            },
            {
              "code": "010303",
              "name": "风机风扇"
            },
            {
              "code": "010304",
              "name": "仪器仪表"
            },
            {
              "code": "010305",
              "name": "泵/管件/阀门"
            },
            {
              "code": "010306",
              "name": "电动机/轴承"
            },
            {
              "code": "010307",
              "name": "紧固件/密封件"
            },
            {
              "code": "010308",
              "name": "刃具/量具/磨具"
            },
            {
              "code": "010309",
              "name": "其他五金工具"
            }
          ]
        },
        {
          "code": "0104",
          "name": "装修装饰",
          "child": [
            {
              "code": "010400",
              "name": "装饰线"
            },
            {
              "code": "010401",
              "name": "连接件"
            },
            {
              "code": "010402",
              "name": "胶粘剂"
            },
            {
              "code": "010403",
              "name": "紧固件"
            },
            {
              "code": "010404",
              "name": "墙体材料"
            },
            {
              "code": "010405",
              "name": "地面材料"
            },
            {
              "code": "010406",
              "name": "顶部材料"
            },
            {
              "code": "010407",
              "name": "其他装修装饰"
            }
          ]
        },
        {
          "code": "0105",
          "name": "家用电器",
          "child": [
            {
              "code": "010500",
              "name": "空调器"
            },
            {
              "code": "010501",
              "name": "制冷电器"
            },
            {
              "code": "010502",
              "name": "清洁电器"
            },
            {
              "code": "010503",
              "name": "厨房电器"
            },
            {
              "code": "010504",
              "name": "电暖器具"
            },
            {
              "code": "010505",
              "name": "声像电器"
            },
            {
              "code": "010506",
              "name": "整容保健电器"
            },
            {
              "code": "010507",
              "name": "其他家用电器"
            }
          ]
        },
        {
          "code": "0106",
          "name": "智能家居",
          "child": [
            {
              "code": "010600",
              "name": "家庭网络"
            },
            {
              "code": "010601",
              "name": "网络家电"
            },
            {
              "code": "010602",
              "name": "信息家电"
            },
            {
              "code": "010603",
              "name": "家庭自动化"
            }
          ]
        },
        {
          "code": "0107",
          "name": "家具装饰",
          "child": [
            {
              "code": "010700",
              "name": "床"
            },
            {
              "code": "010701",
              "name": "沙发"
            },
            {
              "code": "010702",
              "name": "茶几"
            },
            {
              "code": "010703",
              "name": "橱柜"
            },
            {
              "code": "010704",
              "name": "桌椅凳"
            },
            {
              "code": "010705",
              "name": "门/窗"
            },
            {
              "code": "010706",
              "name": "其他家具"
            }
          ]
        },
        {
          "code": "0108",
          "name": "房屋相关",
          "child": [
            {
              "code": "010800",
              "name": "室内消火栓"
            },
            {
              "code": "010801",
              "name": "室内保温墙体"
            },
            {
              "code": "010802",
              "name": "室内空间尺寸"
            },
            {
              "code": "010803",
              "name": "室内空气质量"
            },
            {
              "code": "010804",
              "name": "室内声学性能"
            },
            {
              "code": "010805",
              "name": "室内用探测器"
            },
            {
              "code": "010806",
              "name": "室内外照明场所"
            },
            {
              "code": "010807",
              "name": "室内装饰工程质量"
            },
            {
              "code": "010808",
              "name": "通风系统及室内环境"
            },
            {
              "code": "010809",
              "name": "室内装饰装修材料检测"
            },
            {
              "code": "010810",
              "name": "建筑电气安全性能检测"
            },
            {
              "code": "010811",
              "name": "住宅工程分户质量检验"
            },
            {
              "code": "010812",
              "name": "其它房屋相关"
            }
          ]
        },
        {
          "code": "0109",
          "name": "其他建材家居",
          "child": [
            {
              "code": "010900",
              "name": "装修设计"
            },
            {
              "code": "010901",
              "name": "家居摆件"
            },
            {
              "code": "010902",
              "name": "其他建材家居"
            }
          ]
        }
      ]
    },
    {
      "code": "02",
      "name": "机械设备",
      "child": [
        {
          "code": "0200",
          "name": "机床",
          "child": [
            {
              "code": "020000",
              "name": "机床"
            },
            {
              "code": "020001",
              "name": "机床相关"
            },
            {
              "code": "020002",
              "name": "机床附属装置"
            }
          ]
        },
        {
          "code": "0201",
          "name": "机动车",
          "child": [
            {
              "code": "020100",
              "name": "机动车"
            },
            {
              "code": "020101",
              "name": "机动车尾气"
            },
            {
              "code": "020102",
              "name": "机动车零部件"
            },
            {
              "code": "020103",
              "name": "机动车内/外饰"
            },
            {
              "code": "020104",
              "name": "机动车相关产品"
            }
          ]
        },
        {
          "code": "0202",
          "name": "农业机械",
          "child": [
            {
              "code": "020200",
              "name": "畜牧业机械"
            },
            {
              "code": "020201",
              "name": "农用动力机械"
            },
            {
              "code": "020202",
              "name": "农田建设机械"
            },
            {
              "code": "020203",
              "name": "土壤耕作机械"
            },
            {
              "code": "020204",
              "name": "植物保护机械"
            },
            {
              "code": "020205",
              "name": "农田排灌机械"
            },
            {
              "code": "020206",
              "name": "作物收获机械"
            },
            {
              "code": "020207",
              "name": "农业运输机械"
            },
            {
              "code": "020208",
              "name": "其他农业机械"
            },
            {
              "code": "020209",
              "name": "农产品加工机械"
            },
            {
              "code": "020210",
              "name": "种植和施肥机械"
            },
            {
              "code": "020211",
              "name": "农业机械相关"
            }
          ]
        },
        {
          "code": "0203",
          "name": "矿山机械",
          "child": [
            {
              "code": "020300",
              "name": "破碎设备"
            },
            {
              "code": "020301",
              "name": "采矿机械"
            },
            {
              "code": "020302",
              "name": "采掘机械"
            },
            {
              "code": "020303",
              "name": "钻孔机械"
            },
            {
              "code": "020304",
              "name": "掘进机械"
            },
            {
              "code": "020305",
              "name": "采煤机械"
            },
            {
              "code": "020306",
              "name": "石油钻采"
            },
            {
              "code": "020307",
              "name": "选矿机械"
            },
            {
              "code": "020308",
              "name": "烘干机械"
            },
            {
              "code": "020309",
              "name": "水泥设备"
            },
            {
              "code": "020310",
              "name": "工矿车辆"
            },
            {
              "code": "020311",
              "name": "其他矿山机械"
            }
          ]
        },
        {
          "code": "0204",
          "name": "工程机械",
          "child": [
            {
              "code": "020400",
              "name": "压实机械"
            },
            {
              "code": "020401",
              "name": "混凝土机械"
            },
            {
              "code": "020402",
              "name": "铲土运输机械"
            },
            {
              "code": "020403",
              "name": "其他工程机械"
            }
          ]
        },
        {
          "code": "0205",
          "name": "石化机械",
          "child": [
            {
              "code": "020500",
              "name": "炼油机械"
            },
            {
              "code": "020501",
              "name": "化工机械"
            },
            {
              "code": "020502",
              "name": "制药机械"
            },
            {
              "code": "020503",
              "name": "造纸机械"
            },
            {
              "code": "020504",
              "name": "印刷机械"
            },
            {
              "code": "020505",
              "name": "气体压缩机"
            },
            {
              "code": "020506",
              "name": "石油钻采机械"
            },
            {
              "code": "020507",
              "name": "制冷空调机械"
            },
            {
              "code": "020508",
              "name": "塑料加工机械"
            },
            {
              "code": "020509",
              "name": "其他石化机械"
            },
            {
              "code": "020510",
              "name": "石化机械相关"
            }
          ]
        },
        {
          "code": "0206",
          "name": "电工机械",
          "child": [
            {
              "code": "020600",
              "name": "电池"
            },
            {
              "code": "020601",
              "name": "电焊机"
            },
            {
              "code": "020602",
              "name": "变压器"
            },
            {
              "code": "020603",
              "name": "电线电缆"
            },
            {
              "code": "020604",
              "name": "发电机械"
            },
            {
              "code": "020605",
              "name": "高低压开关"
            },
            {
              "code": "020606",
              "name": "其他电工机械"
            }
          ]
        },
        {
          "code": "0207",
          "name": "仪器仪表",
          "child": [
            {
              "code": "020700",
              "name": "电料装备"
            },
            {
              "code": "020701",
              "name": "电教设备"
            },
            {
              "code": "020702",
              "name": "光学仪器"
            },
            {
              "code": "020703",
              "name": "自动化仪表"
            },
            {
              "code": "020704",
              "name": "成分分析仪"
            },
            {
              "code": "020705",
              "name": "汽车仪器仪表"
            },
            {
              "code": "020706",
              "name": "电工仪器仪表"
            },
            {
              "code": "020707",
              "name": "其他仪器仪表"
            }
          ]
        },
        {
          "code": "0208",
          "name": "特种设备",
          "child": [
            {
              "code": "020800",
              "name": "锅炉"
            },
            {
              "code": "020801",
              "name": "气瓶"
            },
            {
              "code": "020802",
              "name": "电梯"
            },
            {
              "code": "020803",
              "name": "起重机械"
            },
            {
              "code": "020804",
              "name": "客运索道"
            },
            {
              "code": "020805",
              "name": "游乐设施"
            },
            {
              "code": "020806",
              "name": "压力容器/管道"
            },
            {
              "code": "020807",
              "name": "其他特种设备"
            }
          ]
        },
        {
          "code": "0209",
          "name": "包装机械",
          "child": [
            {
              "code": "020900",
              "name": "包装机"
            },
            {
              "code": "020901",
              "name": "装箱机"
            },
            {
              "code": "020902",
              "name": "输送机"
            },
            {
              "code": "020903",
              "name": "其他包装机械"
            }
          ]
        },
        {
          "code": "0210",
          "name": "环保机械",
          "child": [
            {
              "code": "021000",
              "name": "水污染防治设备"
            },
            {
              "code": "021001",
              "name": "大气污染防治设备"
            },
            {
              "code": "021002",
              "name": "固体废物处理设备"
            },
            {
              "code": "021003",
              "name": "其他环保相关机械"
            }
          ]
        },
        {
          "code": "0211",
          "name": "其他机械",
          "child": [
            {
              "code": "021100",
              "name": "其他机械"
            }
          ]
        }
      ]
    },
    {
      "code": "03",
      "name": "生活用品",
      "child": [
        {
          "code": "0300",
          "name": "洗漱用品",
          "child": [
            {
              "code": "030000",
              "name": "毛巾"
            },
            {
              "code": "030001",
              "name": "牙膏"
            },
            {
              "code": "030002",
              "name": "牙刷"
            },
            {
              "code": "030003",
              "name": "香皂"
            },
            {
              "code": "030004",
              "name": "洗发水"
            },
            {
              "code": "030005",
              "name": "护发素"
            },
            {
              "code": "030006",
              "name": "沐浴露"
            },
            {
              "code": "030007",
              "name": "洗面奶"
            },
            {
              "code": "030008",
              "name": "其他洗漱用品"
            }
          ]
        },
        {
          "code": "0301",
          "name": "纸品清洁",
          "child": [
            {
              "code": "030100",
              "name": "纸类"
            },
            {
              "code": "030101",
              "name": "清洁剂"
            },
            {
              "code": "030102",
              "name": "日化用品"
            },
            {
              "code": "030103",
              "name": "石材防护剂"
            },
            {
              "code": "030104",
              "name": "厨房清洁用品"
            },
            {
              "code": "030105",
              "name": "室内清洁用品"
            },
            {
              "code": "030106",
              "name": "其他清洁用品"
            }
          ]
        },
        {
          "code": "0302",
          "name": "床上用品",
          "child": [
            {
              "code": "030200",
              "name": "套件"
            },
            {
              "code": "030201",
              "name": "枕类"
            },
            {
              "code": "030202",
              "name": "被褥类"
            },
            {
              "code": "030203",
              "name": "套罩类"
            },
            {
              "code": "030204",
              "name": "其他床上用品"
            }
          ]
        },
        {
          "code": "0303",
          "name": "化妆用品",
          "child": [
            {
              "code": "030300",
              "name": "化妆品"
            },
            {
              "code": "030301",
              "name": "化妆用工具"
            },
            {
              "code": "030302",
              "name": "其他化妆品相关"
            }
          ]
        },
        {
          "code": "0304",
          "name": "母婴用品",
          "child": [
            {
              "code": "030400",
              "name": "孕妇用品"
            },
            {
              "code": "030401",
              "name": "妈咪用品"
            },
            {
              "code": "030402",
              "name": "婴儿用品"
            }
          ]
        },
        {
          "code": "0305",
          "name": "厨房用具",
          "child": [
            {
              "code": "030500",
              "name": "厨具用具"
            },
            {
              "code": "030501",
              "name": "厨房电器"
            },
            {
              "code": "030502",
              "name": "厨房相关"
            }
          ]
        },
        {
          "code": "0306",
          "name": "劳保用品",
          "child": [
            {
              "code": "030600",
              "name": "头盔"
            },
            {
              "code": "030601",
              "name": "口罩"
            },
            {
              "code": "030602",
              "name": "护膝"
            },
            {
              "code": "030603",
              "name": "防护镜"
            },
            {
              "code": "030604",
              "name": "工作服"
            },
            {
              "code": "030605",
              "name": "防护服"
            },
            {
              "code": "030606",
              "name": "安全网"
            },
            {
              "code": "030607",
              "name": "工作手套"
            },
            {
              "code": "030608",
              "name": "工作围裙"
            },
            {
              "code": "030609",
              "name": "噪音阻抗器"
            },
            {
              "code": "030610",
              "name": "其他劳保用品"
            }
          ]
        },
        {
          "code": "0307",
          "name": "其他生活用品",
          "child": [
            {
              "code": "030700",
              "name": "眼镜"
            },
            {
              "code": "030701",
              "name": "其他生活用品"
            }
          ]
        }
      ]
    },
    {
      "code": "04",
      "name": "文教娱乐",
      "child": [
        {
          "code": "0400",
          "name": "学生相关",
          "child": [
            {
              "code": "040000",
              "name": "书本"
            },
            {
              "code": "040001",
              "name": "校服"
            },
            {
              "code": "040002",
              "name": "课桌椅"
            },
            {
              "code": "040003",
              "name": "修正工具"
            },
            {
              "code": "040004",
              "name": "书写工具"
            },
            {
              "code": "040005",
              "name": "收纳工具"
            },
            {
              "code": "040006",
              "name": "其他学生工具"
            },
            {
              "code": "040007",
              "name": "电子学习用品"
            }
          ]
        },
        {
          "code": "0401",
          "name": "体育用品",
          "child": [
            {
              "code": "040100",
              "name": "健身器材"
            },
            {
              "code": "040101",
              "name": "康体器材"
            },
            {
              "code": "040102",
              "name": "运动护具"
            },
            {
              "code": "040103",
              "name": "运动服饰"
            },
            {
              "code": "040104",
              "name": "体育场馆"
            },
            {
              "code": "040105",
              "name": "户外运动用品"
            },
            {
              "code": "040106",
              "name": "竞赛项目用品"
            },
            {
              "code": "040107",
              "name": "校园体育器材"
            },
            {
              "code": "040108",
              "name": "其它体育用品"
            }
          ]
        },
        {
          "code": "0402",
          "name": "宠物相关",
          "child": [
            {
              "code": "040200",
              "name": "宠物食品"
            },
            {
              "code": "040201",
              "name": "宠物服装"
            },
            {
              "code": "040202",
              "name": "其他宠物相关"
            }
          ]
        },
        {
          "code": "0403",
          "name": "乐器相关",
          "child": [
            {
              "code": "040300",
              "name": "乐器"
            },
            {
              "code": "040301",
              "name": "乐器相关"
            }
          ]
        }
      ]
    },
    {
      "code": "05",
      "name": "农业相关",
      "child": [
        {
          "code": "0500",
          "name": "农药",
          "child": [
            {
              "code": "050000",
              "name": "杀虫剂"
            },
            {
              "code": "050001",
              "name": "杀菌剂"
            },
            {
              "code": "050002",
              "name": "除草剂"
            },
            {
              "code": "050003",
              "name": "其他农药"
            },
            {
              "code": "050004",
              "name": "农药相关"
            }
          ]
        },
        {
          "code": "0501",
          "name": "饲料",
          "child": [
            {
              "code": "050100",
              "name": "配合饲料"
            },
            {
              "code": "050101",
              "name": "混合饲料"
            },
            {
              "code": "050102",
              "name": "预混合饲料"
            },
            {
              "code": "050103",
              "name": "功能性饲料"
            },
            {
              "code": "050104",
              "name": "其他饲料"
            }
          ]
        },
        {
          "code": "0502",
          "name": "肥料",
          "child": [
            {
              "code": "050200",
              "name": "有机肥料"
            },
            {
              "code": "050201",
              "name": "无机复混肥"
            },
            {
              "code": "050202",
              "name": "有机-无机复混肥"
            },
            {
              "code": "050203",
              "name": "其他肥料"
            }
          ]
        },
        {
          "code": "0503",
          "name": "其他农业相关",
          "child": [
            {
              "code": "050300",
              "name": "农用器具"
            },
            {
              "code": "050301",
              "name": "其他农业相关"
            }
          ]
        }
      ]
    },
    {
      "code": "06",
      "name": "皮革及纺织品",
      "child": [
        {
          "code": "0600",
          "name": "衣着用纺织品",
          "child": [
            {
              "code": "060000",
              "name": "纺织面料"
            },
            {
              "code": "060001",
              "name": "纺织辅料"
            },
            {
              "code": "060002",
              "name": "针织成衣"
            },
            {
              "code": "060003",
              "name": "其他衣着用纺织品"
            }
          ]
        },
        {
          "code": "0601",
          "name": "装饰用纺织品",
          "child": [
            {
              "code": "060100",
              "name": "地毯"
            },
            {
              "code": "060101",
              "name": "窗帘"
            },
            {
              "code": "060102",
              "name": "床上用品"
            },
            {
              "code": "060103",
              "name": "家具覆饰"
            },
            {
              "code": "060104",
              "name": "盥洗织物"
            },
            {
              "code": "060105",
              "name": "汽车饰品"
            },
            {
              "code": "060106",
              "name": "墙面贴饰织物"
            },
            {
              "code": "060107",
              "name": "其他装饰用纺织品"
            }
          ]
        },
        {
          "code": "0602",
          "name": "产业用纺织品",
          "child": [
            {
              "code": "060200",
              "name": "农业用纺织品"
            },
            {
              "code": "060201",
              "name": "建筑用纺织品"
            },
            {
              "code": "060202",
              "name": "篷帆类纺织品"
            },
            {
              "code": "060203",
              "name": "过滤与分离用纺织品"
            },
            {
              "code": "060204",
              "name": "其他产业用纺织品"
            }
          ]
        },
        {
          "code": "0603",
          "name": "皮革及其制品",
          "child": [
            {
              "code": "060300",
              "name": "生活用革"
            },
            {
              "code": "060301",
              "name": "国防用革"
            },
            {
              "code": "060302",
              "name": "工农业用革"
            },
            {
              "code": "060303",
              "name": "文化体育用品"
            },
            {
              "code": "060304",
              "name": "其他皮革制品"
            }
          ]
        },
        {
          "code": "0604",
          "name": "其他纺织品",
          "child": [
            {
              "code": "060400",
              "name": "其他纺织品"
            }
          ]
        }
      ]
    },
    {
      "code": "07",
      "name": "工业产品",
      "child": [
        {
          "code": "0700",
          "name": "化肥",
          "child": [
            {
              "code": "070000",
              "name": "复肥"
            },
            {
              "code": "070001",
              "name": "磷肥"
            }
          ]
        },
        {
          "code": "0701",
          "name": "砂轮",
          "child": [
            {
              "code": "070100",
              "name": "砂轮"
            }
          ]
        },
        {
          "code": "0702",
          "name": "水泥",
          "child": [
            {
              "code": "070200",
              "name": "水泥"
            }
          ]
        },
        {
          "code": "0703",
          "name": "内燃机",
          "child": [
            {
              "code": "070300",
              "name": "内燃机"
            }
          ]
        },
        {
          "code": "0704",
          "name": "钢丝绳",
          "child": [
            {
              "code": "070400",
              "name": "钢丝绳"
            }
          ]
        },
        {
          "code": "0705",
          "name": "电线电缆",
          "child": [
            {
              "code": "070500",
              "name": "电线电缆"
            }
          ]
        },
        {
          "code": "0706",
          "name": "耐火材料",
          "child": [
            {
              "code": "070600",
              "name": "耐火材料"
            }
          ]
        },
        {
          "code": "0707",
          "name": "危险化学品",
          "child": [
            {
              "code": "070700",
              "name": "氯碱"
            },
            {
              "code": "070701",
              "name": "无机产品"
            },
            {
              "code": "070702",
              "name": "化学试剂"
            },
            {
              "code": "070703",
              "name": "工业气体"
            },
            {
              "code": "070704",
              "name": "石油产品"
            },
            {
              "code": "070705",
              "name": "有机产品"
            }
          ]
        },
        {
          "code": "0708",
          "name": "危险化学品包装物/容器",
          "child": [
            {
              "code": "070800",
              "name": "危险化学品罐体"
            },
            {
              "code": "070801",
              "name": "危险化学品包装物/容器"
            }
          ]
        },
        {
          "code": "0709",
          "name": "人民币鉴别仪",
          "child": [
            {
              "code": "070900",
              "name": "人民币鉴别仪"
            }
          ]
        },
        {
          "code": "0710",
          "name": "防伪技术产品",
          "child": [
            {
              "code": "071000",
              "name": "防伪技术产品"
            }
          ]
        },
        {
          "code": "0711",
          "name": "公路桥梁支座",
          "child": [
            {
              "code": "071100",
              "name": "公路桥梁支座"
            }
          ]
        },
        {
          "code": "0712",
          "name": "建筑防水卷材",
          "child": [
            {
              "code": "071200",
              "name": "建筑防水卷材"
            }
          ]
        },
        {
          "code": "0713",
          "name": "食品相关产品",
          "child": [
            {
              "code": "071300",
              "name": "压力锅"
            },
            {
              "code": "071301",
              "name": "食品用洗涤剂"
            },
            {
              "code": "071302",
              "name": "电热食品加工设备"
            },
            {
              "code": "071303",
              "name": "食品用纸包装/容器等制品"
            },
            {
              "code": "071304",
              "name": "食品用塑料包装容器工具等制品"
            }
          ]
        },
        {
          "code": "0714",
          "name": "机动车辆制动液",
          "child": [
            {
              "code": "071400",
              "name": "机动车辆制动液"
            }
          ]
        },
        {
          "code": "0715",
          "name": "建筑用钢筋产品",
          "child": [
            {
              "code": "071500",
              "name": "轴承钢材"
            },
            {
              "code": "071501",
              "name": "钢筋混凝土用热轧钢筋"
            }
          ]
        },
        {
          "code": "0716",
          "name": "特种劳动防护用品",
          "child": [
            {
              "code": "071600",
              "name": "特种劳动防护用品"
            }
          ]
        },
        {
          "code": "0717",
          "name": "摩擦材料及密封制品",
          "child": [
            {
              "code": "071700",
              "name": "机械密封"
            },
            {
              "code": "071701",
              "name": "摩擦材料"
            },
            {
              "code": "071702",
              "name": "非金属密封制品"
            }
          ]
        },
        {
          "code": "0718",
          "name": "预应力混凝土用钢材",
          "child": [
            {
              "code": "071800",
              "name": "预应力混凝土用钢材"
            }
          ]
        },
        {
          "code": "0719",
          "name": "卫星电视广播设备",
          "child": [
            {
              "code": "071900",
              "name": "发射设备"
            },
            {
              "code": "071901",
              "name": "地面接收设备卫星专用"
            },
            {
              "code": "071902",
              "name": "接收设备直播卫星专用"
            }
          ]
        },
        {
          "code": "0720",
          "name": "预应力混凝土铁路桥简支梁",
          "child": [
            {
              "code": "072000",
              "name": "预应力混凝土铁路桥简支梁"
            }
          ]
        }
      ]
    },
    {
      "code": "08",
      "name": "认证鉴定",
      "child": [
        {
          "code": "0800",
          "name": "认证服务",
          "child": [
            {
              "code": "080000",
              "name": "认证服务"
            }
          ]
        },
        {
          "code": "0801",
          "name": "鉴定服务",
          "child": [
            {
              "code": "080100",
              "name": "司法鉴定"
            },
            {
              "code": "080101",
              "name": "珠宝鉴定"
            },
            {
              "code": "080102",
              "name": "其他鉴定"
            }
          ]
        }
      ]
    },
    {
      "code": "10",
      "name": "电子电器",
      "child": [
        {
          "code": "1000",
          "name": "通信类",
          "child": [
            {
              "code": "100000",
              "name": "通信设备"
            },
            {
              "code": "100010",
              "name": "其他相关"
            }
          ]
        },
        {
          "code": "1002",
          "name": "家用电器",
          "child": [
            {
              "code": "100200",
              "name": "家用电器"
            }
          ]
        },
        {
          "code": "1001",
          "name": "信息产业",
          "child": [
            {
              "code": "100100",
              "name": "计算机硬件"
            },
            {
              "code": "100101",
              "name": "计算机软件"
            },
            {
              "code": "100102",
              "name": "其他相关"
            }
          ]
        }
      ]
    },
    {
      "code": "11",
      "name": "医药医疗",
      "child": [
        {
          "code": "1100",
          "name": "医疗器械",
          "child": [
            {
              "code": "110000",
              "name": "医疗器械"
            },
            {
              "code": "110001",
              "name": "其他相关"
            }
          ]
        },
        {
          "code": "1101",
          "name": "医药",
          "child": [
            {
              "code": "110100",
              "name": "医药"
            },
            {
              "code": "110101",
              "name": "医药相关"
            }
          ]
        }
      ]
    },
    {
      "code": "12",
      "name": "环境与环保",
      "child": [
        {
          "code": "1200",
          "name": "环境与环保",
          "child": [
            {
              "code": "120000",
              "name": "水质检验"
            },
            {
              "code": "120001",
              "name": "大气监测"
            },
            {
              "code": "120002",
              "name": "其他相关"
            }
          ]
        }
      ]
    },
    {
      "code": "13",
      "name": "计量器具",
      "child": [
        {
          "code": "1300",
          "name": "计量器具",
          "child": [
            {
              "code": "130000",
              "name": "计量器具"
            }
          ]
        }
      ]
    },
    {
      "code": "09",
      "name": "其他类别",
      "child": [
        {
          "code": "0900",
          "name": "条码及其相关",
          "child": [
            {
              "code": "090000",
              "name": "条码/商品编码"
            },
            {
              "code": "090001",
              "name": "条码相关"
            }
          ]
        },
        {
          "code": "0901",
          "name": "烟草及其相关",
          "child": [
            {
              "code": "090100",
              "name": "烟草"
            },
            {
              "code": "090101",
              "name": "烟草相关"
            }
          ]
        },
        {
          "code": "0902",
          "name": "消防及其相关",
          "child": [
            {
              "code": "090200",
              "name": "消防设备"
            },
            {
              "code": "090201",
              "name": "消防相关"
            }
          ]
        },
        {
          "code": "0903",
          "name": "其他类别",
          "child": [
            {
              "code": "090300",
              "name": "其他类别"
            }
          ]
        }
      ]
    }
  ]